Autodesk.Revit.UI.SetupEnergySimulationDialogResult
Specifies identifiers to indicate the return value of the SetupEnergySimulationDialog
Since:
2016
Since:
2016

Autodesk.Revit.UI.SetupEnergySimulationDialogResult.Cancel
The user chose to cancel out of the dialog.

Autodesk.Revit.UI.SetupEnergySimulationDialogResult.Continue
The user chose to continue from the dialog.